const rules = [
    {
        title: "ԹԻՄԵՐԻ ԳՐԱՆՑՈՒՄ",
        content: [
            "Թիմերը պետք է բաղկացած լինեն 3-5 անդամներից",
            "Գրանցումները սկսվելու են հուլիսի 4-ին ժամը 10:00-ից և ավարտվելու 12:00֊ին, նշված ժամից ուշ ժամանած թիմերի գրանցումները չեն ընդունվելու"
        ]
    },
    {
        title: "ՆԱԽԱԳԾԵՐԻ ՄՇԱԿՈՒՄ",
        content: [
            "Նախագիծը պետք է ամբողջությամբ իրականացվի տեղում 48 ժամվա ընթացքում, նախօրոք արված նախագծերը ենթակա են որակազրկման"
        ]
    },
    {
        title: "ՆԱԽԱԳԾԵՐԻ ՀԱՆՁՆՈՒՄ",
        content: [
            "Նախագծերի հանձնման մեկնարկը տրվելու է հուլիսի 5-ին ժամը 18:00 և վերջնական նախագծերի հանձնումը պետք է իրականացվի մինչև հուլիսի 6-ը ժամը 10:00",
            "Վերջնաժամկետից ուշ հանձնված նախագծերը չեն ընդունվելու"
        ]
    },
    {
        title: "ՀԱՆՁՆՄԱՆ ԵՆԹԱԿԱ Է",
        content: [
            "Նախագծի համառոտ նկարագիր",
            "Նախագծի demo հղումը",
            "Նախագծի Github կամ source code-ի հղում",
            "Եթե ունեք պրեզենտացիոն կամ լրացուցիչ այլ ֆայլեր, հանձնում եք նաև դրանք"
        ]
    },
    {
        title: "Այլ կանոններ",
        content: [
            "Հարգալից վերաբերմունք ցուցաբերել մյուս մասնակիցների, կազմակերպիչների և կամավորների նկատմամբ",
            "Հարգել այլ թիմերի տարածքը և չխանգարել՝ առանց իրենց համաձայնության և թույլտվության",
            "Ժամը 00:00-08:00 ընկած ժամանակահատվածում հնարավորինս մինիմալի հասցնել աղմուկը, հատկապես հանգստի զոնաներում",
            "Չմիացնել բարձր երաժշտություն կամ վիդեոներ, անհրաժեշտության դեպքում օգտագործել ականջակալներ",
            "Խուսափել շատ բարձր քննարկումներից, որոնք կարող են խանգարել այլ մասնակիցներին",
            "Պահպանել տարածքի մաքրությունը",
            "VTC-ի տարածքում ծխելը խստիվ արգելվում է, անհրաժեշտության դեպքում դուրս գալ տարածքից",
            "Եվ իհարկե չմոռանաք վայելել փորձառություն, համագործակցել, կիսվել և նոր գիտելիքներ ձեռք բերել"
        ]
    }
]

const Rules = () => {
    return <div className="relative isolate pb-16">
        <div className="mx-auto max-w-6xl px-6 lg:px-8">
            <div className="mx-auto max-w-2xl lg:text-center mb-10">
                <p className="mt-2 text-3xl font-bold tracking-tight text-white sm:text-4xl lg:text-6xl">
                    Մասնակցության կանոններ
                </p>
            </div>

            <div className="space-x-2 space-y-10 p-6 sm:p-10 h-full bg-darkblue-800 bg-opacity-50 backdrop-blur-md rounded-xl max-w-2xl mx-auto lg:max-w-none w-full lg:col-span-5">
                {rules.map((rule, index) => (
                    <div key={index} className="space-y-1">
                        <h2 className="font-semibold text-lg sm:text-xl">{rule.title}</h2>
                        <ul className="text-base sm:text-lg list-disc pl-5">
                            {rule.content.map((item, idx) => (
                                <li key={idx}>{item}</li>
                            ))}
                        </ul>
                    </div>
                ))}
            </div>
        </div>
    </div>
}

export default Rules;